brew "bash"
brew "clang-format"
brew "colima", args: ["HEAD"]
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "htop"
brew "libssh2"
brew "lima"
brew "lua"
brew "lua@5.3"
brew "luarocks"
brew "neovim"
brew "neovim-remote"
brew "node"
brew "pgcli"
brew "pgformatter"
brew "pnpm"
brew "postgresql@14"
brew "pyright"
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift"
brew "tldr"
brew "tmux"
brew "tree-sitter"
brew "vim"
brew "watch"
brew "wget"
brew "yapf"
brew "yarn"
brew "yt-dlp"
cask "fork"
cask "ghostty"
cask "inkscape"
cask "launchcontrol"
cask "testcontainers-desktop"
tap "atomicjar/tap"
