tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "btop"
brew "freetype"
brew "clang-format"
brew "qemu"
brew "lima"
brew "colima", args: ["HEAD"]
brew "coreutils"
brew "libssh2"
brew "curl"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "tree-sitter"
brew "emacs"
brew "entr"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fswatch"
brew "gibo"
brew "git-lfs"
brew "gnu-sed"
brew "htop"
brew "lua"
brew "lua@5.1"
brew "luarocks"
brew "marksman"
brew "neovim"
brew "python@3.11"
brew "neovim-remote"
brew "node"
brew "openjdk"
brew "pgcli"
brew "pgformatter"
brew "php"
brew "postgresql@14"
brew "pyright"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yapf"
brew "yarn"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "inkscape"
cask "kitty"
cask "launchcontrol"
cask "postbird"
vscode "akamud.vscode-theme-onedark"
vscode "asvetliakov.vscode-neovim"
vscode "AykutSarac.jsoncrack-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "IronGeek.vscode-env"
vscode "jdinhlife.gruvbox"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "ritwickdey.LiveServer"
vscode "rvest.vs-code-prettier-eslint"
vscode "timonwong.shellcheck"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "whizkydee.material-palenight-theme"
vscode "XadillaX.viml"
vscode "yinfei.luahelper"
